<template>
  <section class="pt-10 overflow-hidden bg-gray-50 dark:bg-gray-800 md:pt-0 sm:pt-16 2xl:pt-16">
    <div class="px-4 mx-auto sm:px-6 lg:px-8 max-w-7xl">
      <div class="grid items-center grid-cols-1 md:grid-cols-2">
        <div>
          <div class="flex items-end gap-1">
            <span class="text-6xl font-semibold text-orange-500">Offer</span> 
          </div>
          
          <ul class="max-w-lg mt-3  text-xl leading-relaxed text-gray-600 text-gray-400 md:mt-8">
            <li class="pb-4 text-2xl "><u>Мы лидирующая онлайн-платформа для коммерции в России. </u></li>

            <li class="pb-4 text-base">Вот уже более 15 лет мы растём и развиваемся, помогая миллионам людей совершать выгодные сделки по всей стране. </li>

            <li class="pb-4 text-base">Через технологии мы помогаем людям и бизнесу, упрощая решение любых задач — от повседневных до самых важных.</li>

            <li class="pb-4 text-sm"><u>Условия использования</u></li>

            <li class="pb-4 text-xs">
              Пользовательский контент — текст, изображения и видео, которые пользователи Offer размещают в объявлениях, публичной части профиля и отзывах. Цель, с которой пользователи размещают информацию на Offer — установить контакт с потенциальным покупателем, который заинтересован в заключении сделки в отношении товара в объявлении. Размещение пользовательского контента допускается исключительно в информационных целях.

              Вы являетесь обладателем всей информации, которую размещаете на Offer. Вы самостоятельно создаете, изменяете, размещаете в открытом доступе для неограниченного круга лиц и удаляете контент (в том числе персональные данные) без нашего участия или согласования. Компания не несет ответственности за пользовательский контент, размещаемый на Offer, и не выступает его распространителем.
            </li>
            <li class="pb-4 text-xs">
              Если в составе вашего публичного профиля или объявлений вы публикуете свои персональные данные, чтобы пользователи могли связаться с вами или получить наиболее полную информацию о вашем предложении, вы самостоятельно раскрываете их неопределённому кругу лиц. Компания обрабатывает ваши персональные данные в целях исполнения договора с вами – Условий использования Offer.

              Если вы размещаете на Offer персональные данные третьих лиц или иным образом передаете их Компании, вы гарантируете нам, что при этом соблюдены все применимые требования законодательства о персональных данных, включая, но не ограничиваясь, в части наличия необходимых согласий субъектов или иных законных оснований на такие действия.

              Вы обязаны самостоятельно обеспечить полное соответствие пользовательского контента применимому законодательству, Условиям использования Offer, правилам размещения объявлений, требованиям к профилю и отзывам. Вы гарантируете, что ваш контент не нарушает законные права и интересы третьих лиц, в том числе права на результаты интеллектуальной деятельности.

              Offer не обязан заниматься предварительной проверкой пользовательского контента. Мы предпринимаем действия в отношении контента на основании обращений или решений уполномоченных лиц в установленном законодательством Российской Федерации порядке. Запрещены сбор, копирование, использование и любые другие действия в отношении пользовательского контента в целях, не предусмотренных Условиями. Нельзя использовать данные пользователей для целей, не связанных непосредственно с приобретением товара у пользователя.
            </li>

          </ul>
       
        </div>

        <div class="relative">
          <img class="relative w-full xl:max-w-lg xl:mx-auto 2xl:origin-bottom 2xl:scale-110" src="https://cdn.rareblocks.xyz/collection/celebration/images/team/1/business-woman.png" alt="" />
        </div>
      </div>
          <div class="px-4 mx-auto sm:px-6 lg:px-8 max-w-7xl mt-16">
        <div class="max-w-2xl mx-auto text-center">
          <h2 class="text-3xl font-bold leading-tight text-gray-500 sm:text-4xl lg:text-5xl">
            Часто задаваемые вопросы
          </h2>
        </div>
        
        <div class="max-w-3xl mx-auto mt-8 space-y-4 md:mt-16">
          <div v-for="(faq, index) in faqs" :key="index" class="transition-all duration-200 bg-white border border-gray-200 shadow-lg cursor-pointer hover:bg-gray-50">
            <button type="button" @click="toggleAnswer(index)" class="flex items-center justify-between w-full px-4 py-5 sm:p-6">
              <span class="flex text-lg font-semibold text-gray-500  text-black">{{ faq.question }}</span>
              <svg :class="{'rotate-180': activeIndex === index}" xmlns="http://www.w3.org/2000/svg" fill="none" viewBox="0 0 24 24" stroke="currentColor" class="w-6 h-6 text-gray-400 transition-transform duration-200">
                <path stroke-linecap="round" stroke-linejoin="round" stroke-width="2" d="M19 9l-7 7-7-7"></path>
              </svg>
            </button>
            <div v-if="activeIndex === index" class="px-4 pb-5 text-gray-500  sm:px-6 sm:pb-6">
              <p>{{ faq.answer }}</p>
            </div>
          </div>
        </div>
        
        <p class="text-center text-gray-600 text-base mt-9">
          Остались вопросы? Напиши нам по электронной почте
          <span class="hover:text-orange-500 hover:underline"> 
            <a href="mailto:varvar1987a@mail.ru" class="underline">
                exemple@mail.com
            </a>
        </span>
        
        </p>
    </div>
    </div>
  </section>
</template>

<script setup>
import { ref, onMounted } from 'vue';

const faqs = ref([
  {
    question: 'Меня заблокировали. Что делать?',
    answer: 'Если вас заблокировали, то важно знать вот что скорее всего, мы заметили в профиле или объявлениях что-то странное — поэтому нужно убедиться, что это точно не взлом или что-то подобное. Иногда это может занять какое-то время, чтобы во всём разобраться',
  },
  {
    question: 'Как понять, получится восстановить профиль или нет?',
    answer: 'Это зависит от того, что вы видите при входе в профиль. Профиль заблокирован навсегда или Вы нарушили условия использования Offer. Профиль заблокирован. Доступ к профилю ограничен. Нужна проверка',
  },
  {
    question: 'Если я создам новый профиль, меня не заблокируют снова?',
    answer: 'Такой гарантии дать не можем. Например, если заметим попытки взлома, то профиль придётся заблокировать — так мы защищаем ваши данные от злоумышленников. При блокировке восстановить доступ сможет только владелец. Но самый главный совет — не нарушать правила пользования Offer.',
  },
  {
    question: 'А я могу создать новый профиль с таким же  e-mail?',
    answer: 'Не во всех случаях. Если при создании нового профиля вы видите фразу «этот e-mail был в заблокированном профиле» — значит, он открепится только через 90 дней после блокировки. Ускорить этот процесс не получится, это происходит автоматически и в целях безопасности пользователей. В этом случае для регистрации понадобится другой e-mail.',
  },
  
]);

const activeIndex = ref(-1);

const toggleAnswer = (index) => {
  activeIndex.value = activeIndex.value === index ? -1 : index; // Toggle the active index
};

onMounted(() => {

  document.title = "O Нас | Offer";

})
</script>

<style scoped>
.rotate-180 {
  transform: rotate(180deg);
}
</style>
